In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np 
import pandas as pd 
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder

from numpy import array
from numpy import argmax

import json

In [ ]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import matplotlib.pyplot as plt

from matplotlib import rcParams
rcParams['figure.figsize']=10,6
from keras.layers.core import Dense, Activation, Dropout
from keras.layers.recurrent import LSTM
from keras.models import Sequential
import time
from sklearn.metrics import mean_squared_error
from matplotlib import pyplot
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler

from sklearn.metrics import classification_report
from sklearn import metrics

In [ ]:
df=pd.read_csv("./data.csv")

In [ ]:
df.head()

                 STATE_UT_NAME       DISTRICT    JAN  ...  Mar-May  Jun-Sep  Oct-Dec
0  ANDAMAN And NICOBAR ISLANDS        NICOBAR  107.3  ...    540.7   1207.2    892.1
1  ANDAMAN And NICOBAR ISLANDS  SOUTH ANDAMAN   43.7  ...    483.5   1757.2    705.3
2  ANDAMAN And NICOBAR ISLANDS  N & M ANDAMAN   32.7  ...    405.6   1884.4    574.7
3            ARUNACHAL PRADESH          LOHIT   42.2  ...    841.3   1848.5    231.0
4            ARUNACHAL PRADESH     EAST SIANG   33.3  ...    645.4   3008.4    268.1

[5 rows x 19 columns]

In [ ]:
districts=df['DISTRICT'].tolist()

In [ ]:
states=df['STATE_UT_NAME'].tolist()

In [ ]:
len(districts)

641

In [ ]:
values1 = array(states)

In [ ]:
values2 = array(districts)

In [ ]:
label_encoder = LabelEncoder()
integer_encoded1 = label_encoder.fit_transform(values1)
# print(integer_encoded)

label_encoder = LabelEncoder()
integer_encoded2 = label_encoder.fit_transform(values2)
# print(integer_encoded)

In [ ]:
dict1={}
for i in range(len(integer_encoded1)):
  dict1[values1[i]]=integer_encoded1[i]

dict2={}
for i in range(len(integer_encoded2)):
  dict2[values2[i]]=integer_encoded2[i]

In [ ]:
# with open('districts.json', 'w') as fp:
#     json.dump(dict, fp)

In [ ]:
df.head()

                 STATE_UT_NAME       DISTRICT    JAN  ...  Mar-May  Jun-Sep  Oct-Dec
0  ANDAMAN And NICOBAR ISLANDS        NICOBAR  107.3  ...    540.7   1207.2    892.1
1  ANDAMAN And NICOBAR ISLANDS  SOUTH ANDAMAN   43.7  ...    483.5   1757.2    705.3
2  ANDAMAN And NICOBAR ISLANDS  N & M ANDAMAN   32.7  ...    405.6   1884.4    574.7
3            ARUNACHAL PRADESH          LOHIT   42.2  ...    841.3   1848.5    231.0
4            ARUNACHAL PRADESH     EAST SIANG   33.3  ...    645.4   3008.4    268.1

[5 rows x 19 columns]

In [ ]:
df = df.drop(['ANNUAL'], axis = 1)
df = df.drop(['Jan-Feb'], axis = 1)
df = df.drop(['Mar-May'], axis = 1)
df = df.drop(['Jun-Sep'], axis = 1)
df = df.drop(['Oct-Dec'], axis = 1)

In [ ]:
df2 = df

In [ ]:
df2=df2.melt(['STATE_UT_NAME', 'DISTRICT'])

In [ ]:
df2

                    STATE_UT_NAME        DISTRICT variable  value
0     ANDAMAN And NICOBAR ISLANDS         NICOBAR      JAN  107.3
1     ANDAMAN And NICOBAR ISLANDS   SOUTH ANDAMAN      JAN   43.7
2     ANDAMAN And NICOBAR ISLANDS   N & M ANDAMAN      JAN   32.7
3               ARUNACHAL PRADESH           LOHIT      JAN   42.2
4               ARUNACHAL PRADESH      EAST SIANG      JAN   33.3
...                           ...             ...      ...    ...
7687                       KERALA          IDUKKI      DEC   48.1
7688                       KERALA        KASARGOD      DEC   18.4
7689                       KERALA  PATHANAMTHITTA      DEC   51.3
7690                       KERALA         WAYANAD      DEC   25.8
7691                  LAKSHADWEEP     LAKSHADWEEP      DEC   58.8

[7692 rows x 4 columns]

In [ ]:
df2 = df2.rename(columns={'variable': 'month'})

In [ ]:
df2

                    STATE_UT_NAME        DISTRICT month  value
0     ANDAMAN And NICOBAR ISLANDS         NICOBAR   JAN  107.3
1     ANDAMAN And NICOBAR ISLANDS   SOUTH ANDAMAN   JAN   43.7
2     ANDAMAN And NICOBAR ISLANDS   N & M ANDAMAN   JAN   32.7
3               ARUNACHAL PRADESH           LOHIT   JAN   42.2
4               ARUNACHAL PRADESH      EAST SIANG   JAN   33.3
...                           ...             ...   ...    ...
7687                       KERALA          IDUKKI   DEC   48.1
7688                       KERALA        KASARGOD   DEC   18.4
7689                       KERALA  PATHANAMTHITTA   DEC   51.3
7690                       KERALA         WAYANAD   DEC   25.8
7691                  LAKSHADWEEP     LAKSHADWEEP   DEC   58.8

[7692 rows x 4 columns]

In [ ]:
d={'JAN':1,'FEB':2,'MAR' :3,'APR':4,'MAY':5,'JUN':6,'JUL':7,'AUG':8,'SEP':9,
   'OCT':10,'NOV':11,'DEC':12}
df2['month']=df2['month'].map(d)

In [ ]:
df2

                    STATE_UT_NAME        DISTRICT  month  value
0     ANDAMAN And NICOBAR ISLANDS         NICOBAR      1  107.3
1     ANDAMAN And NICOBAR ISLANDS   SOUTH ANDAMAN      1   43.7
2     ANDAMAN And NICOBAR ISLANDS   N & M ANDAMAN      1   32.7
3               ARUNACHAL PRADESH           LOHIT      1   42.2
4               ARUNACHAL PRADESH      EAST SIANG      1   33.3
...                           ...             ...    ...    ...
7687                       KERALA          IDUKKI     12   48.1
7688                       KERALA        KASARGOD     12   18.4
7689                       KERALA  PATHANAMTHITTA     12   51.3
7690                       KERALA         WAYANAD     12   25.8
7691                  LAKSHADWEEP     LAKSHADWEEP     12   58.8

[7692 rows x 4 columns]

In [ ]:
df2.to_csv('file1.csv')

In [ ]:
# y = pd.get_dummies(df2, columns=['STATE_UT_NAME'], prefix='state')
# y = pd.get_dummies(y, columns=['DISTRICT'], prefix='district')
# y = pd.get_dummies(y, columns=['month'], prefix='month')
# y

In [ ]:
df2['STATE_UT_NAME']=df2['STATE_UT_NAME'].map(dict1)
df2['DISTRICT']=df2['DISTRICT'].map(dict2)

In [ ]:
df2

      STATE_UT_NAME  DISTRICT  month  value
0                 0       423      1  107.3
1                 0       553      1   43.7
2                 0       396      1   32.7
3                 2       347      1   42.2
4                 2       173      1   33.3
...             ...       ...    ...    ...
7687             17       233     12   48.1
7688             17       290     12   18.4
7689             17       447     12   51.3
7690             17       620     12   25.8
7691             18       341     12   58.8

[7692 rows x 4 columns]

In [ ]:
df2.dtypes

STATE_UT_NAME      int64
DISTRICT           int64
month              int64
value            float64
dtype: object

In [ ]:
df2 = df2.sort_values(by=['DISTRICT', 'month'])
df2 = df2.sample(frac=1)
df2

       STATE_UT_NAME       DISTRICT  month  value
7499  MADHYA PRADESH        DINDORI     12   16.6
5554  MADHYA PRADESH          HARDA      9  211.6
981         HIMACHAL          KULLU      2   97.0
2378         GUJARAT         BARODA      4    0.8
2538       KARNATAKA         HASSAN      4   55.1
...              ...            ...    ...    ...
5025  ANDHRA PRADESH  WEST GODAVARI      8  227.8
2868         HARYANA          MEWAT      5    9.8
2439     MAHARASHTRA     GADCHIROLI      4   12.2
7463  MADHYA PRADESH         INDORE     12    5.7
2157   UTTAR PRADESH      BALRAMPUR      4    9.3

[7692 rows x 4 columns]